<script setup>
import accordionItem from "~~/components/accordion/accordion-item.vue";
import accordion from "~~/components/accordion/accordion.vue";

components: {
  accordion, accordionItem;
}

const faqs = [
  {
    q: "विडमेट एप कैसे इंस्टॉल करें?",
    a: "<p>विडमेट को इनस्टॉल करने के लिए आपको विडमेट APK का लेटेस्ट वर्जन डाउनलोड करना होगा और एंड्राइड अननोन सोर्सेज की इंस्टालेशन प्रक्रिया को फॉलो करना होगा, क्योंकि इसे सीधे गूगल प्लेस्टोरे से इंस्टॉल नहीं किया जा सकता है।</p>",
  },
  {
    q: "iPhone, iPad या PC पर विडमेट ऐप कैसे इंस्टॉल करें?",
    a: "<p>विडमेट को Windows और Mac उपयोगकर्ताओं के लिए रिलीज़ नहीं किया गया है। यह केवल Android उपयोगकर्ताओं के लिए उपलब्ध है।</p>",
  },
  {
    q: "यूट्यूब वीडियो कैसे डाउनलोड करें?",
    a: `<p>विडमेट के साथ यूट्यूब वीडियो डाउनलोड करना काफी आसान है। बस इन चरणों का पालन करें -</p>
 <ul class="list-decimal"><li>विडमेट ऐप खोलें और होम स्क्रीन सर्च नेविगेशन में Youtube आइकन पर क्लिक करके या Youtube URL लिखकर उसमें YoTube खोलें।</li>
 <li>उस वीडियो को ब्राउज़ करें जिसे आप डाउनलोड करना चाहते हैं और फिर डाउनलोड बटन पर क्लिक करें।</li>
 <li>इच्छित वीडियो क्वालिटी का चयन करें। </li><li>एक बार डाउनलोड पूरा हो जाने पर, अपने सभी डाउनलोड पर जाने के लिए ऊपरी दाएं कोने से डाउनलोड आइकन पर क्लिक करें।</li></ul>`,
  },
  {
    q: "मूवी कैसे डाउनलोड करें?",
    a: `<p> विडमेट से मूवी डाउनलोड करने के लिए इन स्टेप्स को फॉलो करें -</p>
 <ul class="list-decimal"><li>विडमेट ऐप खोलें और मूवी टैब पर क्लिक करें।</li>
 <li>फ़िल्टर पर टैप करें और मूवी नाम के साथ अपनी इच्छित फिल्मों की खोज करें या आप बॉलीवुड मूवीज़, हॉलीवुड मूवीज़, टॉलीवुड मूवीज़ जैसे विभिन्न टैग्स के साथ ब्राउज़ करके फिल्मों को फ़िल्टर कर सकते हैं, और यहां तक कि आप सभी नवीनतम और पुरानी फिल्मों को भाषा और शैली के साथ फ़िल्टर कर सकते हैं।</li>
 <li>एक बार जब आप अपनी इच्छित फिल्म खोज लेते हैं, तो डाउनलोड करना शुरू करने के लिए डाउनलोड बटन पर क्लिक करें ।</li>
 <li>144p, 360p, 480p, 720p, या Full HD (आप जिस भी फॉर्मेट में मूवी डाउनलोड करना चाहते हैं) में से मूवी फॉर्मेट चुनें, फिर डाउनलोड पर क्लिक करें।</li><li>एक बार डाउनलोड हो जाने के बाद, खोजने और खेलने के लिए ऊपरी दाएं कोने से डाउनलोड आइकन पर क्लिक करें।</li> <ul>`,
  },
  {
    q: "फेसबुक वीडियो कैसे डाउनलोड करें?",
    a: `<p>विडमेट के साथ Facebook वीडियो डाउनलोड करने के लिए इन चरणों का पालन करें -</p> 
<ul class="list-decimal"><li>सबसे पहले, ऐप खोलें, फेसबुक आइकन पर क्लिक करें (या होम पेज सर्च नेविगेशन से सिर्फ फेसबुक साइट पर जाएं), और अपने फेसबुक अकाउंट से लॉग इन करें।</li>
 <li>ब्राउज़ करें और वह वीडियो ढूंढें जिसे आप डाउनलोड करना चाहते हैं और डाउनलोड बटन पर क्लिक करें और वीडियो की गुणवत्ता चुनें।</li>
<li>एक बार डाउनलोड हो जाने के बाद, उस डाउनलोड पृष्ठ पर नेविगेट करें जहां आपकी सभी डाउनलोड की गई सामग्री सूचीबद्ध है।</li></ul>`,
  },
  {
    q: "मुफ़्त संगीत कैसे डाउनलोड करें?",
    a: `<p>विडमेट ऐप से फ्री म्यूजिक डाउनलोड करने के लिए इन स्टेप्स को फॉलो करें -</p> 
<ul class="list-decimal"><li>ऐप खोलें और होम स्क्रीन साइट नेविगेशन बार से म्यूजिक चैनल पर क्लिक करें।</li>
<li> वह संगीत शैली चुनें जिसे आप डाउनलोड करना चाहते हैं।</li>
 <li>गाने पर क्लिक करके उसे ओपन करें और फिर डाउनलोड बटन पर क्लिक करें।</li>
<li>वह गुणवत्ता चुनें जिसमें आप अपना पसंदीदा गाना डाउनलोड करना चाहते हैं।</li><li>एक बार डाउनलोड हो जाने के बाद, संगीत चलाने के लिए ऊपरी दाएं कोने में स्थित डाउनलोड आइकन पर क्लिक करें।</li></ul>`,
  },
  {
    q: "इंस्टाग्राम वीडियो कैसे डाउनलोड करें?",
    a: `<p>विडमेट के साथ Instagram वीडियो डाउनलोड करने के लिए इन चरणों का पालन करें -</p> 
 <ul class="list-decimal"><li>इंस्टाग्राम ऐप खोलें और होम स्क्रीन सर्च नेविगेशन से इंस्टाग्राम साइट पर जाएं।</li>
 <li>अपने इंस्टाग्राम अकाउंट में लॉग इन करें और फिर वह वीडियो खोलें जिसे आप डाउनलोड करना चाहते हैं।</li>
<li>डाउनलोड बटन पर क्लिक करें।</li><li>एक बार डाउनलोडिंग समाप्त हो जाने पर। डाउनलोड पृष्ठ पर नेविगेट करें और प्ले पर क्लिक करें।</li></ul>`,
  },
];
</script>
<template>
  <accordion head="विडमेट के बारे में अक्सर पूछे जाने वाले प्रश्न">
    <accordion-item v-for="(faq, index) in faqs" :key="index">
      <template v-slot:accordion-trigger> {{ faq.q }} </template>
      <template v-slot:accordion-content>
        <div v-html="faq.a"></div>
      </template>
    </accordion-item>
  </accordion>
</template>